#-*- coding:gb18030 -*-

itemDict = {
    '112': 'H汇畅',
    '113': 'Y一嗨',
    '114': 'Q屈臣氏（上海交行）',
    '115': 'R如家',
    '117': 'W味千',
    '118': 'Y益海嘉里',
    '119': 'D达芙妮',
    '120': 'H环迅',
    '121': 'H汇付天下',
    '122': 'K可的',
    '123': 'N农工商',
    '124': 'L乐购',
    '125': 'Q全家',
    '126': 'H海南新生',
    '127': 'J家乐福',
    '128': 'J家得利',
    '129': 'H哈根达斯',
    '130': 'K康师傅',
    '131': 'S施华洛世奇',
    '132': 'C车友',
    '133': 'X携程',
    '134': 'Y英模特',
    '135': 'L来伊份',
    '136': 'D蒂芙尼',
    '137': 'X西提',
    '138': 'L拉夏贝尔',
    '139': 'X星巴克',
    '140': 'X喜士多',
    '141': 'Y易初莲花',
    '142': 'Z智造空间',
    '143': 'O欧尚',
    '144': 'L乐欧',
    '145': 'L骆鸿',
    '181': 'X鞋柜',
    '221': 'Q屈臣氏（广东中行）',
    '222': 'G广东天翼',
    '223': '',
    '224': 'T太保财险',
    '225': 'T太保人寿',
    '226': 'D达芙妮（上海农行）',
    '261': 'M莫泰',
    '281': 'Y圆通',
    '282': 'J交行积分',
    '301': 'D德邦',
    '302': 'H和路雪',
    '325': 'W无标识',
    '402': 'D点点客',
    '543': 'B北京医院',
    '544': 'K卡耐丁',
    '553': 'Y银联供应链',
    '638': 'F福农通',
    '639': 'B北代',
    '640': 'N宁波南代',
    '641': 'G广州南代',
    '642': 'L辽宁直联T0',
    '643': 'X现场注册',
    '644': 'H黄埔',
    '645': 'HY-智能POS',
    '742': 'S杉德多多付',
    '743': 'Y银拓',
    '886': 'Y银联线上',
    '898': 'B北代49',
    '899': 'H黄埔49',
    '900': 'G广东南代49',
    '901': 'Q清算-台州',
    '902': 'Q清算-村镇',
    '904': 'Z弈轩二维码',
    '1129': 'H恒大集团',
    '1130': 'J间联北代',
    '1131': 'J间联北代49',
    '1132': 'J间联广东南代',
    '1133': 'J间联广东南代49',
    '1134': 'J间联黄埔',
    '1135': 'J间联黄埔49',
    '1136': 'J间联久付',
    '1137': 'J间联久付49',
    '1138': 'J间联久久付',
    '1139': 'Z直联北代',
    '1156': 'C传统-00（东北分公司专用）',
    '1157': 'B北京一鸣(东北分公司专用)',
    '1158': 'W网络商城（东北分公司专用）',
    '1172': 'S杉德黄埔',
    '1173': 'S杉德黄埔49',
    '1182': 'Y银联赈灾',
    '1183': 'J间联冠儒1',
    '1184': 'J间联冠儒2',
    '1185': 'K卡说二维码',
    '1187': 'Z中石化',
    '1188': 'L辽宁直联T0-凯富（东北专用）',
    '1189': 'CBXW',
    '1581': 'X小微商户',
    '1591': 'J间联久付减免',
    '1596': 'J间联广州银嘉',
    '1597': 'J间联东北优惠',
    '1598': 'J间联东北减免',
    '1599': 'J间联东北49',
    '1600': 'J间联山西优惠',
    '1601': 'J间联山西减免',
    '1602': 'J间联山西49',
    '1603': 'J间联浙江优惠',
    '1604': 'J间联浙江减免',
    '1605': 'J间联浙江49',
    '1606': 'H黄埔久久付',
    '1608': 'D哆啦云49',
    '1609': 'D哆啦云标准',
    '1610': 'D哆啦云商旅',
    '1663': 'Z浙江间联49',
    '1668': 'Z直联黄埔',
    '1669': 'J间联北代优惠',
    '1670': 'J间联北代减免',
    '1674': 'E二维码支付',
    '1675': 'J间联东北标准',
    '1676': 'J间联广东',
    '1677': 'J间联广东优惠',
    '1678': 'J间联广东49',
    '1679': 'J间联广东减免',
    '1701': 'W网络支付',
    '1789': 'J交行聚合',
    '1790': 'H黄埔标准',
    '1791': 'H黄埔优惠',
    '1792': 'H黄埔减免',
    '1793': 'B北代信用卡还款',
    '1794': 'B北代标准',
    '1795': 'B北代49-线上',
    '1796': 'B北代优惠',
    '1797': 'B北代减免',
    '1798': 'B北代商旅-线上',
    '1799': 'B北代商旅-线上1',
    '1800': 'B北代标准-线上',
    '1801': 'B北代烟草-线上',
    '1802': 'J间联CBXW标准',
    '1803': 'J间联CBXW优惠',
    '1804': 'J间联CBXW49',
    '1805': 'J间联CBXW减免',
    '1807': 'H互联网支付',
    '1808': 'J聚财通',
    '1809': 'D大连出租车',
    '1821': 'SD-线上标准',
    '1822': 'SD-线上49',
    '1823': 'SD-线上商旅',
    '1824': 'J间联山西标准',
    '1843': 'Z助农取款',
    '1862': 'J间联闪付',
    '1894': 'J间联青岛标准',
    '1895': 'J间联青岛优惠',
    '1896': 'J间联青岛49',
    '1897': 'J间联青岛减免',
    '1929': 'Z直联云闪付',
    '2122': 'J间联商户',
    '2156': '827进件-WZXS',
    '2157': 'DFB类业务',
    '2158': 'Y银联条码前置-汇金',
    '2163': 'Y银联条码前置-聚合'
}

#获取项目标识中文名
def getItemName(itemId):
    value = itemId.rstrip()
    try:
        name = itemDict[value]
    except KeyError:
        name = "未知项目(%s)" % value
    return name

#通道id字典
chnlDict = {
    '00000160' : '上海直联通道',
    '00000440' : '交行银企通道',
    '00000611' : '网联付款通道',
    '00000653' : '上海T1代付通道',
    '00000730' : '平安垫资代付通道',
    '00000991' : '合肥平安T1代付通道',
    '00000910' : '银联客户资金清算',
    '00000911': '银联代付911',
    '00000884' : '银联代付（浙江）D1-杭州',
}

#获取通道中文名
def getChnlName(chnlId):
    value = chnlId.rstrip()
    try:
        name = chnlDict[value]
    except KeyError:
        name = "未知通道(%s)" % value
    return name

#代付垫资类型 1-杉德垫资  0-通道垫资
payChnlFundType = {
    '00000611' : 1,
    '00000653' : 1,
    '00000911' : 0,
    '00000991' : 1,
    '00000910' : 1,
    '00000160' : 0,
    '00000884' : 1
}

#获取通道垫资类型
def getFundType(chnlId):
    value = chnlId.rstrip()
    try:
        type = payChnlFundType[value]
    except KeyError:
        type = -1
    return type
